Repository: isaleem/cumin
Catalog: MediaCore/mediacore/i18n/*/LC_MESSAGES/mediacore.po
Languages: fi

source: Pop Out
fi: Avautuu

source: Shrink
fi: Kutista

source: Expand
fi: Laajenna

source: Share
fi: Jaa

source: Permalink:
fi: Suoralinkki:

source: Share by email
fi: Jaa sähköpostilla

source: Share by Email
fi: Jaa sähköpostilla

source: Share on Facebook
fi: Jaa Facebookissa

source: Share on Twitter
fi: Jaa Twitterissä

source: Embed
fi: Upota

source: Embeddable Player HTML:
fi: Upotettava HTML-koodi:

source: Download
fi: Lataa

source: All Podcasts
fi: Kaikki podcastit

source: Add to iTunes
fi: Lisää iTunesiin

source: Subscribe via RSS
fi: Tilaa RSS-syötteen kautta

source: Latest Episodes
fi: Uusimmat jaksot

source: Browse all episodes
fi: Selaa kaikki jaksot

source: %(result_count)s Episodes
fi: %(result_count)s jaksot

source: Upload Videos
fi: Lataa videot

source: Upload Error
fi: Latausvirhe

source: During your upload, something went wrong, but don't worry. The engineers and gnomes have been automagically notified and we're already on our way to resolving your issue.
fi: Jotain meni pieleen latauksen aikana, mutta ei hätää. Insinöörit ja maahiset hälytettiin automaagisesti ja olemme jo matkalla ratkaisemaan ongelman.

source: Something you can check:
fi: Voit tarkistaa jotain:

source: Is the file under %(maxUploadSize)s Megabytes in size?
fi: Onko tiedosto alle %(maxUploadSize)s megatavua?

source: Try Uploading Again
fi: Yritä ladata uudelleen

source: Choose a file to upload
fi: Valitse ladattava tiedosto

source: Problems?
fi: Ongelmia?

source: If you have problems uploading or have some questions, please email us at
fi: Jos sinulla on latausongelmia tai muuta kysyttävää, lähetä meille sähköpostia osoitteeseen

source: Upload Successful
fi: Lataus onnistui

source: Awesome, your upload was successful!
fi: Mahtavaa, lataus onnistui!

source: Your submission is awaiting review by a moderator and will be posted shortly.
fi: Lähetyksesi odottaa valvojan hyväksyntää.

source: You will be automatically redirected back to the [1:Media Library] in a few seconds. Hang tight.
fi: Sinut ohjataan automaattisesti takaisin [1: Mediakirjastoon] muutamassa sekunnissa. Pidä tiukasti kiinni.
