Repository: isaleem/cumin
Catalog: MediaCore/mediacore/i18n/*/LC_MESSAGES/mediacore.po
Languages: fi

source: Upload your media using the form below. We'll review it and get back to you.
fi: Lähetä media alla olevalla lomakkeella. Luemme sen, ja palaamme asiaan.

source: Latest media in %s
fi: Viimeisin mediatiedosto %s:ssa

source: We're sorry but we weren't able to process this request.
fi: Pahoittelemme, mutta emme pystyneet käsittelemään pyyntöäsi.

source: Latest RSS
fi: Viimeisimmät RSS

source: Sitemap XML
fi: XML-sivukartta

source: Sitemap RSS
fi: RSS-sivukartta

source: Your comment has been rejected.
fi: Kommenttisi on hylätty.

source: Thank you for your comment! We will post it just as soon as a moderator approves it.
fi: Kiitos kommentistasi! Julkaisemme sen heti, kun moderaattori on sen hyväksynyt.

source: File "%s" does not exist.
fi: Tiedostoa "%s" ei ole olemassa.

source: No action to perform.
fi: Ei suorittavia toimenpiteitä.

source: Permission denied, cannot write file
fi: Pääsy kielletty, tiedostoon ei voi kirjoittaa.

source: Unsupport image type: %s
fi: Kuvan tiedostotyyppi ei ole kelvollinen:%s

source: The portion of the email address before the @ is invalid
fi: Sähköpostiosoitteen @-merkkiä edeltävä osa ei kelpaa

source: The portion of this email address after the @ is invalid
fi: Sähköpostiosoitteen @-merkin jälkeinen osa ei kelpaa

source: Please enter your name!
fi: Kirjoita nimesi!

source: Username
fi: Käyttäjänimi

source: Password
fi: Salasana

source: Login
fi: Kirjaudu

source: At least give it a short description...
fi: Lisää lyhyt kuvaus ...

source: You've gotta have a name!
fi: Nimi on pakollinen!

source: You've gotta have a title!
fi: Otsikko on pakollinen!

source: Your Name:
fi: Nimesi:

source: Your Email:
fi: Sähköpostiosoitteesi:

source: (will never be published)
fi: (Ei julkaista)

source: Title:
fi: Otsikko:

source: Description:
fi: Kuvaus:

source: Oops! You forgot to enter a file.
fi: Oho! Unohdit lähettää tiedoston.

source: OR:
fi: TAI:

source: Submit
fi: Lähetä

source: SEARCH...
fi: ETSI...

source: You forgot to select an image!
fi: Unohdit valita kuvan!

source: Name
fi: Nimi

source: Permalink
fi: Suoralinkki

source: Parent Category
fi: Pääkategoria

source: Cancel
fi: Peruuta

source: Save
fi: Tallenna

source: Delete
fi: Poista

source: Comment
fi: Kommentti

source: Display Name
fi: Näyttönimi

source: Bad duration formatting, use Hour:Min:Sec
fi: Väärä kestoformaatti, käytä tunti:min:sek

source: Value must be in the format wxh; e.g. 200x300
fi: Arvon tulee olla muotoa leveys x korkeus, esim. 200x300

source: Width must be a valid integer
fi: Leveyden pitää olla kokonaisluku

source: Height must be a valid integer
fi: Korkeuden pitää pitää olla kokonaisluku

source: Select an encoded video or audio file on your computer
fi: Valitse video- tai äänitiedosto tietokoneeltasi

source: Upload
fi: Lataa

source: Add URL
fi: Lisää URL

source: Delete file
fi: Poista tiedosto

source: Include in the Podcast
fi: Sisällytä Podcastiin

source: Optional
fi: Valinnainen

source: Title
fi: Otsikko

source: Author Name
fi: Tekijän nimi

source: Author Email
fi: Kirjoittajan sähköposti

source: Description
fi: Kuvaus

source: Categories
fi: Kategoriat

source: Tags
fi: Tunnisteet

source: e.g.: puppies, great dane, adorable
fi: esim: pennut, tanskandoggi, suloinen

source: Administrative Notes
fi: Admin-puolen muistinpanot

source: General Options:
fi: Yleiset asetukset:

source: Yes, use the Flash Player when the device supports it.
fi: Kyllä, käytä Flash Playeriä, jos laite tukee sitä.

source: No, use the HTML5 Player when the device supports it.
fi: Ei, käytä HTML5 Playeriä, jos laite tukee sitä.

source: Prefer the Flash Player when possible
fi: Käytä mieluummin Flash Playeriä jos mahdollista

source: Script Tag
fi: Komentosarjatunnus

source: The unique script tag given for your site.
fi: Sivuston uniikki komentosarjatunnus.

source: Player Options:
fi: Player-vaihtoehdot:

source: Disable the player keyboard controls.
fi: Poista playerin näppäinohjaimet.

source: Enable high-def quality by default.
fi: HD-laatu oletuksena.

source: Parental Advisory
fi: Varoitus vanhemille

source: Clean
fi: Siisti

source: Subtitle
fi: Tekstitys

source: Podcast Details:
fi: Podcastin tiedot:

source: Explicit?
fi: Eksplisiittinen?

source: Category
fi: Luokka

source: Copyright
fi: Tekijänoikeudet

source: Advanced Options:
fi: Lisäasetukset:

source: Your Feed URL
fi: Syötteen URL

source: Prepend
fi: Käsittele

source: Append
fi: Liitä

source: Plain <textarea> fields (0kB)
fi: Tavalliset <textarea> kentät (0Kb)

source: Enable TinyMCE for <textarea> fields accepting XHTML (281kB)
fi: Käytä TinyMCE-editoria niiden <textarea> kenttien kanssa, jotka hyväksyvät XHTML:n (281kB)

source: Brown
fi: Ruskea

source: Blue
fi: Sininen

source: Green
fi: Vihreä

source: Tan
fi: Vaaleanruskea

source: White
fi: Valkoinen

source: Purple
fi: Violetti

source: Black
fi: Musta

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Email Notifications:
fi: Sähköposti-Ilmoitukset:

source: Media Uploaded
fi: Media-tiedosto ladattu

source: Comment Posted
fi: Kommentti lähetetty

source: Support Requested
fi: Tukipyyntö lähetetty

source: Send Emails From
fi: Lähetä sähköpostia

source: Popularity Algorithm Variables:
fi: Suosituimmuus-algoritmin muuttujat:

source: Decay Exponent
fi: Kulutuseksponentti

source: Decay Lifetime
fi: Kulutuselinikaari

source: Max. allowed upload file size in megabytes
fi: Maks. sallittu ladatavan tiedoston koko megatavuina

source: Legal Wording:
fi: Sallittu kieliasu::

source: User Uploads
fi: Käyttäjän lataukset

source: Google Analytics Details:
fi: Google Analyticsin tiedot:

source: Tracking Code
fi: Seurantakoodi

source: Site Maps
fi: Sivustokartat

source: RSS Feeds
fi: RSS-syötteet

source: General Settings:
fi: Yleiset asetukset:

source: Site Name
fi: Sivuston nimi

source: Display Site Name
fi: Näytä sivuston nimi

source: Default Language
fi: Oletuskieli

source: Featured Category
fi: Kiinnostavimmat

source: Rich Text Editing
fi: Sisällön muokkaaminen

source: Require comments to be approved by an admin
fi: Pääkäyttäjän on hyväksyttävä kommentit

source: Akismet Key
fi: Akismetin avain

source: Akismet URL
fi: Akismetin URL

source: Filtered Words
fi: Suodatettu sanat

source: Enter words to be filtered separated by a comma.
fi: Kirjoita suodattavia sanoja pilkulla erotettuina.

source: Require a key to access the API
fi: API:n avain vaaditan

source: API Key:
fi: API:n avain

source: Access Key
fi: Pääsyavain

source: API Settings:
fi: API:n asetukset

source: Max media results
fi: Media-tiedostojen tuloksien maksimimäärä

source: Max tree depth
fi: Maks. hakemiston syvyys

source: General
fi: Yleinen

source: Upload Logo
fi: Lataa logo

source: Background Image
fi: Taustakuva

source: Upload Background
fi: Lataa tausta

source: Background color
fi: Taustaväri

source: Link color
fi: Linkin väri

source: Visited Link color
fi: Avatun linkin väri

source: Text color
fi: Tekstin väri

source: Heading color
fi: Otsikon väri

source: Color Scheme
fi: Värit

source: Options
fi: Valinnat

source: Enable Cooliris on the Explore Page
fi: Aktivoi väripaletti

source: Enable Featured Items on the Explore Page
fi: Tutustumissivun kiinnostavimat kohteet

source: Enable Podcast Tab
fi: Podcast:n välilehti päälle

source: Enable User Uploads
fi: Käyttäjän lataus päälle

source: Enable widescreen media player by default
fi: Laajakuva-mediasoitin oletuksena

source: Display Logo
fi: Näytä logo

source: Display Background Image
fi: Näytä taustakuva

source: Advanced
fi: Lisäasetukset

source: Custom CSS
fi: Oma CSS-tyyli

source: Custom Header HTML
fi: Oma HTML-otsikko

source: Custom Footer HTML
fi: Oma HTML-alatunniste

source: Reset to Defaults
fi: Nollaa oletusarvoihin

source: Banner HTML
fi: Mainospalkin HTML

source: Sidebar HTML
fi: Sivupalkin HTML

source: User name already exists
fi: Käyttäjänimi on jo olemassa

source: Email Address
fi: Sähköpostiosoite

source: Login Details:
fi: Kirjautumisen tiedot:

source: Passwords do not match
fi: Salasanat eivät täsmää

source: Confirm password
fi: Vahvista salasana

source: FTP Server Details:
fi: FTP-palvelimen tiedot:

source: Server Hostname
fi: Palvelimen nimi

source: Subdirectory on server to upload to
fi: Alihakemisto, johon ladataan

source: How many times should MediaDrop try to verify the FTP upload before declaring it a failure?
fi: Montako kertaa järjestelmä yrittää todentaa FTP-latauksen ennen virheilmoitusta?

source: HTTP URL to access remotely stored files
fi: HTTP URL -yhteys etä-tallennettuihin tiedostoihin

source: RTMP Server URL to stream remotely stored files (Optional)
fi: RTMP palvelimen URL etä-tallennettujen tiedostojen toistamiseen (valinnainen)

source: Options specific to Local File Storage:
fi: Paikallisen tietovaraston asetukset:

source: Path to store files under
fi: Tiedostojen tallennuspolku

source: Defaults to the "data_dir" from your INI file.
fi: INI-tiedoston "data_dir" oletusarvot.

source: RTMP Server URL
fi: RTMP-palvelimen URL

source: Files must be accessible under the same name as they are stored with locally.
fi: Tiedostoissa pitää käyttää samaa nimeä, millä ne on tallennettu paikallisesti.

source: Add another URL
fi: Lisää toinen URL

source: RTMP server URLs must begin with rtmp://
fi: RTMP-palvelimen URL-osoitteiden pitää alkaa rtmp: / /

source: RTMP Servers:
fi: RTMP-palvelimet:

source: New %(type)s: %(title)s
fi: Uudet %(type)s : %(title)s

source: A new %(type)s file has been uploaded! Title: %(title)s Author: %(author_name)s (%(author_email)s) Admin URL: %(edit_url)s Description: %(clean_description)s
fi: Uusi %(type)s tiedosto on ladattu! Otsikko: %(title)s Tekijä: %(author_name)s (%(author_email)s) Admin URL: %(edit_url)s Kuvaus: %(clean_description)s

source: New Comment: %(comment_subject)s
fi: Uusi kommentti: %(comment_subject)s

source: A new comment has been posted! Author: %(author_name)s Post: %(post_url)s Body: %(comment_body)s
fi: Uusi kommentti on lähetetty! Kirjoittaja: %(author_name)s Viesti: %(post_url)s Body: %(comment_body)s

source: New Support Request: %(email)s
fi: Uusi tukipyyntö: %(email)s

source: A user has asked for support Email: %(email)s URL: %(url)s Description: %(description)s GET_VARS: %(get_vars)s POST_VARS: %(post_vars)s
fi: Käyttäjä on pyytänyt tukea Email: %(email)s URL: %(url)s Kuvaus: %(description)s GET_VARS: %(get_vars)s POST_VARS: %(post_vars)s

source: Audio
fi: Äänite

source: Audio Description
fi: Äänitiedoston kuvaus

source: Captions
fi: Kuvatekstit

source: Help
fi: Ohjeet

source: Plain HTML5 Player
fi: HTML5-soitin

source: HTML5 + Flowplayer Fallback
fi: HTML5 + Flowplayer varmistustila

source: Sublime Video Player
fi: Sublime videosoitin

source: iTunes Player
fi: iTunes-soitin

source: Unusable file or URL provided.
fi: Epäkelpo tiedosto tai URL-osoite.

source: FTP Storage
fi: FTP-varasto

source: Could not upload the file from your FTP server: %s
fi: Tiedostoa ei voi ladata FTP-palvelimelta:%s

source: The file transferred to your FTP server is corrupted. Please try again.
fi: FTP-palvelimelle siirretty tiedosto on vioittunut. Yritä uudelleen.

source: Could not download the file from your FTP server: %s
fi: Ei voi ladata tiedostoa FTP-palvelimelta:%s

source: Local File Storage
fi: Paikallinen tiedostovarasto

source: Remote URLs
fi: Etä-URLit

source: A %(code)s Error has Occurred
fi: %(code)s Virhe tapahtui

source: Whoopsadaisy!
fi: Hups!

source: We can't find this page. The page may have been moved or removed.
fi: Emme löydä tätä sivua. Ehkä se on siirretty tai poistettu.

source: If you typed the address in, check the spelling.
fi: Tarkista osoitteen oikeinkirjoitus.

source: You have a few options:
fi: Vaihtoehdot:

source: Return to the [1:homepage].
fi: Palaa takaisin [1: kotisivu].

source: Return to the [1:media page].
fi: Palaa takaisin [1: media sivu].

source: Fill out an error report below.
fi: Täytä virheraportti.

source: Email: (so we can contact you if we find it!)
fi: Sähköposti: (jotta voimme ottaa sinuun yhteyttä!)

source: What were you looking for when you got the error?
fi: Mitä teit, kun sait virheilmoituksen?

source: Submit Error Report
fi: Lähetä virheraportti

source: Like
fi: Tykkää

source: View
fi: Katsaus

source: Page:
fi: Sivu:

source: Show:
fi: Näytä:

source: Latest
fi: Uusimmat

source: Most Popular
fi: Suosituimmat

source: Featured
fi: Kiinnostavimmat

source: Page
fi: Sivu

source: The %(fieldName)s field accepts some HTML formatting: %(formattingList)s
fi: %(fieldName)s kenttä hyväksyy joitakin HTML-muotoiluja: %(formattingList)s

source: Feeds:
fi: Syötteet:

source: [1:MediaDrop] [2:video platform]
fi: [1:MediaDrop] [2:videoalusta]

source: Logout
fi: Kirjaudu ulos

source: Explore
fi: Tutki

source: Media Library
fi: Mediakirjasto

source: Podcasts
fi: Podcastit

source: Search
fi: Etsi

source: Moderate comments
fi: Moderoi kommentteja

source: Moderate
fi: Moderoi

source: Comments
fi: Kommentit

source: Published
fi: Julkaistu

source: Unreviewed
fi: Tarkastamattomia

source: Trash
fi: Roskis

source: Dashboard
fi: Hallintapaneeli

source: Awaiting Review
fi: Odotetaan arviointia

source: Awaiting Encoding
fi: Odotetaan koodausta

source: Awaiting Publishing
fi: Odotetaan julkaisua

source: Get Started
fi: Aloita

source: Add New Media
fi: Lisää uusi mediatiedosto

source: Recently Published
fi: Åskettäin julkaistut

source: View Site
fi: Katsele sivusto

source: Media
fi: Mediatiedosto

source: Users
fi: Käyttäjät

source: Settings
fi: Asetukset

source: Confirm Delete
fi: Vahvista poisto

source: Are you sure you want to delete these %(num)s items?
fi: Oletko varma, että haluat poistaa nämä %(num)s kohteet?

source: Add Category
fi: Lisää kategoria

source: Bulk Delete
fi: Massapoisto

source: Edit Category
fi: Muokkaa kategoriaa

source: Delete Category
fi: Poista kategoria

source: Are you sure you want to delete this category [1:and ALL of its children]?
fi: Oletko varma, että haluat poistaa tämän kategorian [1: ja kaikki alimaiset]?

source: Edit
fi: Muokkaa

source: Status
fi: Tila

source: Author
fi: Tekijä

source: In Response to
fi: Vastauksena

source: None Found
fi: Ei löydy

source: This comment has already been approved for publishing
fi: Tämä kommentti on jo hyväksytty julkaistavaksi

source: Approve this comment for publishing
fi: Hyväksy tämä kommentti julkaistavaksi

source: Approve
fi: Hyväksy

source: Delete this comment
fi: Poista tämä kommentti

source: Submitted on
fi: Toimitettiin

source: Go to the admin page for this item
fi: Siirry hallinta-sivulle

source: Comments for %(media_filter_title)s
fi: Kommentit %(media_filter_title)s

source: Comments for
fi: Kommentit

source: Edit Text
fi: Muokkaa tekstiä

source: Cancel Edit
fi: Peruuta muokkaus

source: Are you sure you want to delete %(name)s's comment?
fi: Haluatko varmasti poistaa %(name)s kommentin?

source: Comments that match '%(search)s'
fi: Vastaavat kommentit " %(search)s "

source: All Comments
fi: Kaikki kommentit

source: Comments for %(search)s
fi: Kommentit %(search)s

source: Publish
fi: Julkaise

source: Bulk Actions
fi: Massatoimet

source: Are you sure you want to delete this?
fi: Haluatko varmasti poistaa tämän?

source: Publish Date
fi: Julkaisupäivä

source: Upload Date
fi: Latauspäivämäärä

source: Publish Status
fi: Julkaisutila

source: Number of Comments
fi: Kommenttien määrä

source: Unencoded
fi: Koodaamattomat

source: Draft
fi: Luonnos

source: Publishing...
fi: Julkaistaan ...

source: Saving the file failed. Please try again
fi: Tallentaminen epaonnistui. Yritä uudelleen

source: Security error occured (%(text)s)
fi: Tapahtui virhe ( %(text)s )

source: Error caused a send or load operation to fail (%(text)s)
fi: Virhe, lähetys tai lataus epäonnistui ( %(text)s )

source: File has already been added, duplicates are not allowed
fi: Tiedosto on jo lisätty, tuplakopiot eivät ole sallittuja

source: File is too small, the minimal file size is %(size)s
fi: Tiedosto on liian pieni, tiedoston minimikoko on %(size)s

source: File is too large, the maximum file size is %(size)s
fi: Tiedosto on liian suuri, tiedoston maksimikoko on %(size)s

source: File could not be added, amount of %(num)s files exceeded
fi: Tiedostoa ei voitu lisätä, tiedostojen määrä%(num)s ylittyi

source: File is too big, overall filesize of %(size)s exceeded
fi: Liian suuri tieosto, yleinen tiedostokoko %(size)s ylittyi

source: Upload image
fi: Lataa kuva

source: Are you sure you want to delete this file?
fi: Haluatko varmasti poistaa tämän tiedoston?

source: Upload a file
fi: Lataa tiedosto

source: Failed to add this file. Please try again.
fi: Tiedoston lisäys epäonnistui. Yritä uudelleen.

source: Failed to save your change. Please try again.
fi: Tallentaminen epäonnistui. Yritä uudelleen.

source: Uploading
fi: Ladataan

source: Queued
fi: Jonossa

source: Error
fi: Virhe

source: A connection problem occurred, try again.
fi: Yhteys katkesi, yritä uudelleen.

source: An error has occurred, try again.
fi: Virhe, yritä uudelleen.

source: Hide
fi: Piilota

source: Saving
fi: Tallennetaan

source: Saved!
fi: Tallennettu!

source: Saving failed. Please try again.
fi: Tallentaminen epäonnistui. Yritä uudelleen.

source: Please correct the highlighted errors and save again.
fi: Korjaa virheet ja tallenna uudelleen.

source: Uploaded:
fi: Ladatut:

source: Files
fi: Tiedostot

source: Add & Manage
fi: Lisää & hallinnoi

source: View this file
fi: Esikatsele

source: Thumbnail
fi: Pikkukuvake

source: Thumb
fi: Kuvake

source: Manage Files
fi: Hallinnoi tiedostoja

source: File
fi: Tiedosto

source: Size
fi: Koko

source: Duration
fi: Kesto

source: Bitrate
fi: Kuvan laatu

source: Dimensions
fi: Mitat

source: Type
fi: Tyyppi

source: OR
fi: TAI

source: or
fi: tai

source: Media that matches '%(search)s'
fi: Vastaavat videot " %(search)s "

source: %(podcastTitle)s Episodes
fi: %(podcastTitle)s jaksot

source: Media in '%(categoryName)s'
fi: Videot kategoriassa "%(categoryName)s"

source: Media tagged '%(tagName)s'
fi: Videot tunnisteella " %(tagName)s "

source: Unreviewed Media
fi: Tarkastamattomat videot

source: Unencoded Media
fi: Koodaamattomat videot

source: Draft Media
fi: Käsittelemätön video

source: Published Media
fi: Julkaistut videot

source: All Media
fi: Kaikki mediat

source: Review
fi: Arvostelu

source: Drafts
fi: Luonnokset

source: Filters
fi: Suodattimet

source: View this media where it is published
fi: Näytä tämä media, kun se on julkaistu

source: View this media where it will be published
fi: Näytä tämä media, kun se julkaistaan

source: Preview
fi: Esikatselu

source: You must add a file and save before review can begin.
fi: Sinun täytyy ladata ja tallentaa tiedosto ennen tarkastelun aloittamista.

source: Review Pending
fi: Tarkistus vireillä

source: Encoding Complete
fi: Koodaus suoritettu

source: Encoding Pending
fi: Koodaus vireillä

source: Click to change the publish date
fi: Klikkaa, jos haluat muuttaa julkaisupäivän

source: Publishing
fi: Julkaistaan

source: Pending
fi: Vireillä

source: Review Complete
fi: Arviointi suoritettu

source: Review can only be completed after a file is added.
fi: Tarkastelu voidaan toteuttaa vasta sitten, kun tiedosto on lisätty.

source: Encoding will be complete when an acceptable file is added.
fi: Koodaus suoritetaan sitten, kun kelvollinen tiedosto on lisätty.

source: Publish Now
fi: Julkaise nyt

source: Players
fi: Soittimet

source: By deleting this player you will lose all settings related to it.
fi: Poistamalla tämän soittimen, menetät kaikki siihen liittyvät asetukset.

source: Priority
fi: Etusija

source: Up
fi: Ylös

source: Down
fi: Alas

source: Category:
fi: Kategoria:

source: Author:
fi: Tekijä:

source: Explicit
fi: Nimenomainen

source: Add episode
fi: Lisää episodi

source: View First Episode %(num)s
fi: Näytä ensimmäinen %(num)s jakso

source: Edit Podcast
fi: Muokkaa podcastia

source: New Podcast
fi: Uusi podcasti

source: View this podcast where it is published
fi: Esikatsele podcasti

source: Get an iTunes URL
fi: iTunes URL

source: Get a Feedburner URL
fi: Feedburner URL

source: Add Podcast
fi: Lisää podcasti

source: Advertising
fi: Mainonta

source: Analytics
fi: Tilastot

source: Generate
fi: Generoi

source: Appearance
fi: Ulkoasu

source: Confirm Reset
fi: Vahvista palautus

source: Are you sure you want to reset your settings to the default?
fi: Oletko varma, että haluat palauttaa oletusasetukset?

source: Notifications
fi: Ilmoitukset

source: Popularity
fi: Suosio

source: RSS and Sitemaps
fi: RSS ja sivustokartat

source: Storage Engines
fi: Varastointimoottorit

source: Plugins
fi: Laajennukset

source: Notification Emails
fi: Ilmoitussähköpostit

source: New Storage Engine
fi: Uusi varastointimootori

source: WARNING:
fi: VAROITUS:

source: Deleting this Storage Engine (%(name)s) will:
fi: Poistetaan tämä varastointimoottori (%(name)s):

source: Permanently delete all of the %(num)s media files stored by this Storage Engine.
fi: Poistaa pysyvästi kaikki %(num)s varastoidut mediatiedostot.

source: Permanently erase its settings.
fi: Poistaa asetuksia pysyvästi.

source: An alternative to deleting is disabling. Disabling a Storage Engine will simply prevent its use for files added from now on.
fi: Vaihtoehto poistamiselle on ottaa pois käytöstä. Kun otat varastointimoottorin pois käytöstä, vaikutus kohdistuu vain tuleviin tiedostoihin.

source: Disable
fi: Pois päältä

source: Add New Engine
fi: Lisää uusi moottori

source: Disk Usage
fi: Levyn käyttö

source: Please select what type of storage engine you would like to add:
fi: Valitse, minkälaisen varastointimoottorin haluat lisätä:

source: Add Tag
fi: Lisää tunniste

source: Edit Tag
fi: Muokkaa tunnistetta

source: Delete Tag
fi: Poista tunniste

source: New User
fi: Uusi käyttäjä

source: Are you sure you want to delete this user?
fi: Oletko varma, että haluat poistaa tämän käyttäjän?

source: Add User
fi: Lisää käyttäjä

source: Email
fi: Sähköposti

source: Group
fi: Ryhmä

source: View More
fi: Katso lisää

source: There is no media in this category.
fi: Tässä kategoriassa ei ole yhtään mediaa.

source: Choose a Category:
fi: Valitse kategoria:

source: said on %(datetime)s…
fi: sanoi %(datetime)s ...

source: No comments have been posted yet.
fi: Kommentteja ei ole vielä lähetetty.

source: Write a comment
fi: Kirjoita kommentti

source: Email Address (will never be published)
fi: Sähköpostiosoite (ei julkaista)

source: Submit Comment
fi: Lähetä kommentti

source: As soon as there are more than %(num)s published videos in the library, the most popular videos will be listed here.
fi: Heti kun kirjastossa on julkaistu yli %(num)s videoita, suosituimmat videot on lueteltu tässä.

source: Why not add a few more?
fi: Miksi ei lisättäisi vielä muutama?

source: Search: "%s"
fi: Etsi: "%s"

source: Showing %(result_count)s results for '%(search_query)s'
fi: Näytetään %(result_count)s tulokset " %(search_query)s "

source: Showing %(result_count)s results tagged with '%(tag_name)s'
fi: Näytetään %(result_count)s tuloksia merkkitty " %(tag_name)s "

source: All %(result_count)s Media
fi: Kaikki %(result_count)s media

source: All Tags
fi: Kaikki tunnisteet

source: (unpublished)
fi: (Julkaisematon)

source: by %(authorName)s
fi: Tekijältä %(authorName)s

source: Dislike
fi: Ei tykätty

source: Related Podcast
fi: Vastaavat podcastit

source: Podcast Episodes
fi: Podcast-jaksoja

source: Episode
fi: Jakso

source: Related Media
fi: Vastaava media

source: This is not listed under any categories.
fi: Tätä ei ole listattu missään ryhmässä.

source: See All Tags
fi: Katso kaikki tunnisteet

source: This does not have any associated tags.
fi: Ei ole liitettyjä tunnisteita.

source: Pop out a new player window
fi: Avautuu uuteen ikkunaan
